package com.example.testsapp

object Repository {

    const val testName = "КАКОИ ЖВОТНЕ ВЫ КУСАИТИ?"

    val test =  listOf(
        Question(questionText = "КАКОЙ РУКОЙ ВЫ ПОДЗЫВАИТИ ЖВОТНИЕ?",
        options = listOf(
            Option("ЛЕВОЙ РУКОЙ", 0),
            Option("ПРАВОЙ РУКОЙ", 1),
            Option("ОБОИМИ РУКАМИ", 6, 3),
        )),
        Question(questionText = "КАК ВЫ ОБЫЧНО КУСАИТИ ЖВОТНЕ?",
            options = listOf(
                Option("Я ДОГОВАРИВАЮСЬ С ЖВОТНЕ КОГДА У НЕГО СВОБОДНОЕ ВРЕМЯ БЕРУ КЛАДУ В РОТ ЖВОТНЕ И СЛЕГКА ПРИДАВЛИВАУ ЗУБАМИ НО НЕ СИЛНО ТАК ПРОДОЛЖАИТСЯ ДО СОСТОЯНИЯ УКУСА", 2),
                Option("Я ПОДСТИРИГАЮ С ОТКРЫТОМ РТОМ В ВЫЖИДАНИИ И ЖДУ ПОКА ЖВОТНЕ САМО ЗАБИРЁТСЯ КО МНЕ В РОТ ЧТО БЫ ЕГО УКУСИТ", 3),
                Option("Я БЕГУ ЗА ЖВОТНЕ ИЗОВСЕХ СИЛ С ОТКРЫТОМ РТОМ ЧТО БЫ УКУСИТ НАБЕГУ", 4),
            )),
        Question(questionText = "КАК ВЫ ДУМАИТИ ЕСЛИ ЖВОТНЕ БУДЕТ КУСАТ ВАС ТОДЖЕ НАСКОЛКО ЕМУ ЭТО ПОНРАВИСЯ?",
            options = listOf(
                Option("ОЧЕН ПОНРАВИТСЯ", 1),
                Option("ЕМУ ЭТО НЕ ОЧЕН ПОНРАВИСТЯ", 0),
            )),
        Question(questionText = "ЕСЛИ ВЫ ПОБИЖИТЕ ЗА ЖВОТНЕ ВЫ СМОЖИТЕ ЕГО ДОГНАТЬ?",
            options = listOf(
                Option("ДА Я ОЧЕН ХОРОШО ПОБЕГУ Я ДОГАНЮ Я ОБЕЩАЮ", 6, 2),
                Option("НАВЕРНОЕ НЕ СМОГУ ПОТОМ ЧТО Я УСТАЮ", 2),
                Option("Я НЕ СМОГУ ПОБЕЖАТ ЗА ЖВОТНЕ ИЗВИНИТЕ ПОЖАЛУСТА", 5, 100),
            )),
        Question(questionText = "КАК ЧАСТО ВЫ ХОДИТЕ ИСКАТ ЖВОТНЕ?",
            options = listOf(
                Option("1 РАС В ДЕНЬ", 0),
                Option("1 РАС В НЕДЕЛУ", 1),
                Option("1 РАС В ГОД", 3),
                Option("ЖВОТНЕ САМО НАХОДИТ МЕНЯ", 4),
            )),
        Question(questionText = "ЕСЛИ ЖВОТНЕ ЗАНЯТО КУСАНИЕМ В ДАННЫЙ МОМЕНТ ДОЖДЁТЕСЬ ЛИ ВЫ ПОКА ОНО ЗАКОНЧИТ ИЛИ ПРЕРВЁТЕ ЕВО?",
            options = listOf(
                Option("Я ДОЖДУСЬ ПОКА КУСАНИЕ БУДЕТ ЗАКОНЧЕНО", 0),
                Option("Я НЕДОЖДУС И БУДУ КУСАТ ЖВОТНЕ ПОВЕРХ ЕГО КУСАНИЯ", 6),
            )),
        Question(questionText = "ЕСЛИ ЖВОТНЕ ЯВЛЯЕТСЯ ЯДОВИТЫМ И КУСАЕТ ВАС, МОЖНО ЛИ ЕГО КУСАТ В ОТВЕТ?",
            options = listOf(
                Option("ДА МОЖНО ТАК БУДЕТ ПРАВИЛНО", 1),
                Option("НЕТ НЕМОЖНО ЭТО НЕ СОВСЕМ ПРАВИЛНО", 4),
            )),
        Question(questionText = "ЕСЛИ ЖВОТНЕ КУСАИТ НЕСПЕЦИАЛНО НУЖНО ЛИ ЕГО ТОЖЕ КУСАТ В ОТВЕТ НЕСПЕЦИАЛНО?",
            options = listOf(
                Option("ПОЛУЧАЕТСЯ ЧТО НУЖНО", 0),
                Option("НЕПОЛУЧАЕТСЯ", 3),
            )),
        Question(questionText = "ДОПУСТИМ ВЫ КУСАИТИ ЖЫВОТНЕЕ И ВАС ВДРУГ УВИДИЛО ДРУГОЕ ЖВОТНЕЕ ВАШИ ДЕЙСТВИЯ?",
            options = listOf(
                Option("Я ПРОДОЛЖУ КУСАТ", 6),
                Option("Я НЕ ПРОДОЛЖУ КУСАТ ПРОСТО ОСТАНОВЛУСЬ", 1),
                Option("Я БУДУ КУСАТ И ТО ЖИВОТНЕЕ И ЭТО ПОТОМУ ЧТО ТАК ПРАВИЛНО", 1),
            )),
        Question(questionText = "ДОПУСТИМ ВЫ ПОЙМАЛИ ОЧИН ЗЛОГО ЖВОТНЕ ОНО СМОТРИТ НА ВАС ЗЛИТСЯ И КУСАЕТ ТРЯПКУ ДУМАЯ ЧТО КУСАЕТ ВАС. ВАШИ ДЕЙСТВИЯ?",
            options = listOf(
                Option("НАЧНУ КУСАТ ЖВОТНЕЕ ЧТО БЫ ОНО ПОНИМАЛО КАК ПРАВИЛНО", 0),
                Option("Я ТОЖЕ ТОГДА БУДУ КУСАТ ТРЯПКУ", 2),
                Option("Я ПОСТАРЮС ОБЪЯСНИТ ЖВОТНЕ ЧТО ПРОИЗОШЛА ОШИБКА И ПРЕДЛОЖУ УКУСИТ СЕБЯ ПОНАСТОЯЩЕМУ", 3),
                Option("В ТАКОМ СЛУЧАИ Я НАВЕРНОЕ НЕ БУДУ КУСАТ ЖВОТНЕ", 4),
            )),
    )

    val outcomes = listOf(
        Outcome("ВЫ КУСАИТИ ЧЁРНОГО ХОРЯ. ЭТО ЧИН ДАЖЕ НЕПЛОХО ПО СЕГОДНГЯШНИМ МЕРКАМ!", R.drawable.hor),
        Outcome("ВЫ КУСАИТЕ НОЧНИЦУ!(ЭТО ЛИТУЧАЯ МЫШ)", R.drawable.nochnica),
        Outcome("ВЫ КУСАИТИ АНДАТРУ", R.drawable.andatra),
        Outcome("ВЫ КУСАИТИ ЗАЙЦА И ВЫ ЕГО ДОГНАЛИ ЭТО ДОЛГОЖДАННЫЙ ТРОФЕЙ НО НЕЗАБЫВАИТИ ЕГО НУЖНО КУСАТ НЕСИЛНО!!!", R.drawable.zayac),
        Outcome("ВЫ КУСАИТИ ВОРОБЬЯ И ВСЕХ ЕГО ДРУЗЕЙ", R.drawable.vorobey),
        Outcome("К СОЖАЛЕНИЮ ВЫ НЕ ПОЙМАЛИ ЖВОТНЕ И НЕ КУСАИТИ ЕВО! ВЫ ПРОСТО СТОИТЕ В ПОЛЕ И СМОТРИТЕ ПОСТОРОНАМ И ВАМ ХОРОШО!", R.drawable.nikogo),
        Outcome("ВЫ ДАГНАЛИ ЕВРАПЕЙСКАВА ЛЕСНОВА КАТА НО ЧТОБЫ ЕГО ХОРОШЕНКО УКУСИТ ПРИДЕТСЯ ПОСТАРАТСЬЯ! НО КОГДА ОН ВАС УВИДИЛ ПОЧЕМУТО ОЧИН СИЛНО СПРЯТАЛСЯ И НЕ ВЫЛАЗИЕТ", R.drawable.kot),
    )
}
